community_app_api/app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
    @post_comments = Post.find(params[:id]).comments
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

  def create
    @post = Post.create(post_params)
---
INSERT INTO "posts" ("title", "username", "link", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "a"], ["username", "a"], ["link", "a"], ["description", "a"], ["created_at", "2020-01-14 19:13:53.989082"], ["updated_at", "2020-01-14 19:13:53.989082"]]

  def update
    post = Post.find(params[:id])
    post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "username" = $2, "link" = $3, "description" = $4, "updated_at" = $5 WHERE "posts"."id" = $6  [["title", "asd"], ["username", "asd"], ["link", "asd"], ["description", "aasd"], ["updated_at", "2020-01-15 01:21:33.569935"], ["id", 11]]